---
kind: method
id: M:Autodesk.Revit.DB.MEPSystem.GetPhysicalNetworksNumber
zh: 系统
source: html/23ca7db4-fa65-1149-95d7-9f17b80e073a.htm
---
# Autodesk.Revit.DB.MEPSystem.GetPhysicalNetworksNumber Method

**中文**: 系统

Get the physical networks number in the system.

## Syntax (C#)
```csharp
public int GetPhysicalNetworksNumber()
```

## Returns
The number of physical networks.